app/controllers/intranet/categories_controller.rb

INSERT INTO "categories" ("created_at", "updated_at", "name", "kind_of_posts_id", "inativar") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["created_at", "2024-08-22 19:44:31.558294"], ["updated_at", "2024-08-22 19:44:31.558294"], ["name", "1"], ["kind_of_posts_id", nil], ["inativar", 0]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save