app/controllers/intranet/kind_of_posts_controller.rb

  def index
    @kind_of_posts = KindOfPost.all
---
SELECT "kind_of_posts".* FROM "kind_of_posts"

  def create
    @kind_of_post = KindOfPost.new(kind_of_post_params)

    respond_to do |format|
      if @kind_of_post.save
---
INSERT INTO "kind_of_posts" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Teste"], ["created_at", "2024-08-22 19:44:21.061288"], ["updated_at", "2024-08-22 19:44:21.061288"]]