app/controllers/intranet/posts_controller.rb

  def index

    if params[:kind_of_post_id]
      @posts = Post.all.where('kind_of_post_id' => params[:kind_of_post_id]).order(id: :desc)
    else
      @posts = Post.all.order(id: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."kind_of_post_id" = ? ORDER BY "posts"."id" DESC  [["kind_of_post_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC

  def create
    @kind = params[:kind]
    @post = Post.new(post_params)
    if params[:foto_principal]
      data =  params[:foto_principal]
      image_data = Base64.decode64(data['data:image/png;foto_principal,'.length .. -1])
      File.open("#{Rails.root}/public#{@post.foto_principal.url.to_s}", 'wb') do |f|
        f.write image_data
      end
      # // Carierwave method to regenerate thumbnails
      @post.image.recreate_versions!
    end

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("titulo", "subtitulo", "descricao", "data", "created_at", "updated_at", "inativar", "kind_of_post_id", "category_id", "keywords", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"