app/controllers/intranet/veiculos_controller.rb

  def create
    @intranet_veiculo = Intranet::Veiculo.new(intranet_veiculo_params)

    respond_to do |format|
      if @intranet_veiculo.save
---
INSERT INTO "intranet_veiculos" ("ano", "modelo", "preco", "observacao", "descricao", "quilometragem", "cor", "anofab", "combustivel", "procedencia", "inativo", "destaque", "codigo", "versao", "placa", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"