app/controllers/intranet/veiculos_controller.rb

SELECT "veiculos".* FROM "veiculos"
---
  def index
    @intranet_veiculos = Veiculo.all

SELECT "veiculos".* FROM "veiculos" WHERE "veiculos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @intranet_veiculo = Veiculo.find(params[:id])

INSERT INTO "intranet_veiculos" ("ano", "modelo", "preco", "observacao", "descricao", "quilometragem", "cor", "anofab", "combustivel", "procedencia", "inativo", "destaque", "codigo", "versao", "placa", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "veiculos" ("ano", "modelo", "preco", "observacao", "descricao", "quilometragem", "cor", "anofab", "combustivel", "procedencia", "inativo", "destaque", "codigo", "versao", "placa", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @intranet_veiculo = Veiculo.new(intranet_veiculo_params)

    respond_to do |format|
      if @intranet_veiculo.save

UPDATE "intranet_veiculos" SET "updated_at" = ? WHERE "intranet_veiculos"."id" = ?  [["updated_at", "2024-08-27 19:32:15.989133"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @intranet_veiculo.update(intranet_veiculo_params)

SELECT "veiculos".* FROM "veiculos" WHERE "veiculos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_intranet_veiculo
      @intranet_veiculo = Veiculo.find(params[:id])