app/views/intranet/posts/_form.html.erb

SELECT "kind_of_posts".* FROM "kind_of_posts"
---
          <div class="col-md-9 col-sm-9 col-xs-12">
            <%= collection_select :post, :kind_of_post_id, KindOfPost.all, :id, :name, {prompt: 'Selecione o tipo de postagem (obrigatório)',selected: @kind }, {:class=>"form-control", :id=>"tipopostagem", :required =>"true"}  %>

SELECT "categories".* FROM "categories" WHERE "categories"."inativar" = ?  [["inativar", 0]]
---
          <div class="col-md-9 col-sm-9 col-xs-12">
            <%= collection_select :post, :category_id, Category.all.where(inativar: false), :id, :name, {prompt: 'Selecione a categoria', :include_blank => "Nenhuma"}, {:class=>"form-control"}  %>