app/views/intranet/categories/_form.html.erb

SELECT "kind_of_posts".* FROM "kind_of_posts"
---
          <div class="col-md-6 col-sm-6 col-xs-12">
            <%= collection_select :category, :name, KindOfPost.all, :id, :name, {:include_blank => "Nenhum"}, {:class=>"form-control col-md-7 col-xs-12"}  %>