app/views/layouts/intranet.html.erb

SELECT "kind_of_posts".* FROM "kind_of_posts"
---
                  </li> -->
                  <% KindOfPost.all.each do |tipospost| %>